<?php

//陣列宣告方式

//$a=array();
//$a=[1,2,3,4];
//$a=["小明","小華","小強","阿國"];
//$a=[12=>"小明",23=>"小華",30=>"小強",42=>"阿國"];
//$a=["小明"=>12,"小華"=>23,"小強"=>30,"阿國"=>42];

/* $a[]=12;
$a[]=22;
$a[]=333;
$a[]=39; */

/* $a[22]="小明";
$a[23]="小華";
$a[30]="小強"; */

$a["小明"]=22;
$a["小華"]=23;
$a["小強"]=30;

echo "<pre>";print_r($a);echo "</pre>";

echo $a["小華"];

echo "<hr>";
//陣列的維度

//$a=[[1,2,3],[4,5,6],[7,8,9]];
$a=[
    "小明"=>["國文"=>32,"英文"=>60,"歷史"=>99],
    "小華"=>["國文"=>32,"英文"=>60,"數學"=>77],
    "小強"=>["國文"=>32,"英文"=>60,"數學"=>77,"歷史"=>0,"化學"=>56,"公民"=>89],
    "阿國"=>42
   ];

$b="AAAA";

echo "<pre>";print_r($a);echo "</pre>";
echo "<hr>";

//陣列函式
echo "count(\$a)=>";
echo count($a);
echo "<hr>";
echo "is_array(\$a)=>";
echo is_array($a);
echo "<hr>";
echo "in_array(\$a)=>";
echo in_array(["國文"=>32,"英文"=>60,"歷史"=>99],$a);
echo '<hr>';
echo "<pre>";print_r($a);echo "</pre>";
echo "sort(\$a)";
sort($a);
echo "<pre>";print_r($a);echo "</pre>";
echo "<hr>";
$a1=array_fill(0,10,"blue");
echo "<pre>";print_r($a1);echo "</pre>";
?>